{
  "code": 0,
  "data": [
    {
      "pub_date": "2022-09-18T12:00:00Z",
      "version": "2.5.22091801",
      "notes": [
        "[IMPROVED] Conversation - Added 3 new emoji reaction",
        "[IMPROVED] Conversation - Added Sorting Logic on Group Member Listing while Removing - The least active user will be sorted on the top of the list, so that group moderator able to decide to remove them from group easily.",
        "[IMPROVED] Meeting - Improved Meeting Participants List View during screen sharing.",
        "[IMPROVED] Optimization and Bug Fixes"
      ]
    },
    {
      "pub_date": "2022-09-12T12:00:00Z",
      "version": "2.5.22091204",
      "notes": [
        "[NEW] New Name Card Interface - Revamp the name card interface, and moved the Settings Menu to the section for ease of access.",
        "[IMPROVED] Optimized RAPID Role labelling - Now everyone can add/edit label for the member in the group.",
        "[NEW] Added External (EXT^) labelling - Clearer indicator for external users and group that have members from external, next step will will be to optimize the labels to be more accurate and flexible.",
        "[NEW] Added size of Group Members - At a glance, you will be able to see how many members are in the group.",
        "[NEW] Added New Status: “Don’t Disturb” - While you are on “DND” status, you will NOT receive any notification (except for call - will be included in the future phase). You may set the duration for the status in Mac App.",
        "[NEW] Added Account Deactivate Reminder - Email reminder will be sent weekly upon 30 days inactivity until account deactivation.",
        "[IMPROVED] Meeting Audio Volume - Adjusted volume for loud-speaker mode.",
        "[NEW] Added Meeting Bot - Reminder to users upon a meeting is scheduled or when there is upcoming meeting.",
        "[FIXED] Big fixes"
      ]
    },
    {
      "pub_date": "2022-09-03T12:00:00Z",
      "version": "2.5.22090303",
      "notes": [
        "[NEW] Conversation - Group: Added RAPID Role Labelling for members, moderator(s) is/are able to label all the group members, while the members can only label themselves.",
        "[IMPROVED] User account will be deactivated when there is no activity for 60 days, other users will not be able to find the deactivated user until the next login of the deactivated user.",
        "[IMPROVED] Optimization and Bug Fixes"
      ]
    },
    {
      "pub_date": "2022-08-27T12:00:00Z",
      "version": "2.5.22082705",
      "notes": [
        "[NEW] Added configuration for group update reminder (weekly/monthly).",
        "[IMPROVED] Optimized search feature, includes UI optimization, search by BU Name, and so on.",
        "[IMPROVED] Enhanced experience on screen sharing, others can take over screen sharing directly instead of getting the original person to stop his/her screen sharing first.",
        "[FIXED] Bug fixes and optimization."
      ]
    },
    {
      "pub_date": "2022-08-20T12:00:00Z",
      "version": "2.4.22082001",
      "notes": [
        "[IMPROVED] The optimized desktop version for Apple chips is now available, M1/M2 only",
        "[IMPROVED] Meeting - Added “mute others” feature in group meeting",
        "[IMPROVED] Meeting - Added meeting join/leave activity log upon meeting started",
        "[IMPROVED] Meeting - Auto-volume-adjustment when user use earphone",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-08-14T12:00:00Z",
      "version": "2.4.22081404",
      "notes": [
        "[NEW] Conversation - Added manual archive conversation feature, you are able to archive the conversation manually.",
        "[NEW] Conversation - Added shortcut (beside search box) to switch between the recent conversations, up to 20 conversations.",
        "[IMPROVED] Meeting - Added notification for people joining and leave a meeting in both grouo chat and bullet chat.",
        "[IMPROVED] Meeting - Added notification for unmuted the mic (with sound) in bullet chat.",
        "[IMPROVED] Meeting - Indicating the speaker on the top left when in the full screen sharing mode.",
        "[IMPROVED] Meeting - Added number of participants next to the meeting title.",
        "[IMPROVED] IM Optimization - Fixed the \"read\" count unsynchronized.",
        "[IMPROVED] IM Optimization - Fixed the conversation list refreshing bug.",
        "[IMPROVED] IM Optimization - Improved the message push mechanism to expedite the message handling.",
        "[FIXED] Big fixes"
      ]
    },
    {
      "pub_date": "2022-08-06T12:00:00Z",
      "version": "2.4.22080603",
      "notes": [
        "[IMPROVED] Workspace Enhancement -Enhanced Workspace app browser capability which can ease users to move forward and back (by futures team).",
        "[IMPROVED] Added 1 to 1 Meeting scheduling feature.",
        "[IMPROVED] Meeting bottom menu bar will be hidden upon the mouse cursor moves out from the meeting window.",
        "[IMPROVED] Change of meeting UI.",
        "[FIXED] Big fixes"
      ]
    },
    {
      "pub_date": "2022-07-31T12:00:00Z",
      "version": "2.4.22073101",
      "notes": [
        "[NEW] Name Card Like - You may “Like” your colleagues via their name card now!",
        "[IMPROVED] Group Message archived period setting -Added message archive setting for group, you can select up to 90 days.",
        "[IMPROVED] Message Forwarding - Added combined forwarding feature that allows you to forward multiple message in just single post.",
        "[NEW] Markdown Editor - Added markdown editor tool in Wea Workspace to assist bot owner to compose markdown formatted message.",
        "[IMPROVED] Meeting - Added confirmation alert for joining a meeting when the users click on any meeting button/link",
        "[IMPROVED] Meeting - Improve meeting started notification by using markdown card.",
        "[IMPROVED] Meeting - Display of meeting duration upon meeting ended and invite user to give a feedback for the meeting.",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-07-23T12:00:00Z",
      "version": "2.4.22072305",
      "notes": [
        "[NEW] Profile Image - Click profile image to view the zoom-in image.",
        "[IMPROVED] Meeting Notification - Improved meeting started notification with “@all” instead of just posting the link.",
        "[IMPROVED] Meeting feedback - All attendees able to provide feedback of the meeting in group with a simple click.",
        "[IMPROVED] In-meeting Chat - Click the meeting chat icon to view the full chat messages in the meeting.",
        "[IMPROVED] In-meeting notification - Instead of alert ring, new joiner notification will be posted as bullet chat when there are more than 3 participants or meeting has started for a period.",
        "[IMPROVED] Chat Folder V3 - Added keyword filter condition for customised chat folder.",
        "[NEW] @ Shortcut - Added “@“ shortcut to ease user to jump to the message that the user being tagged in group chat.",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-07-16T12:00:00Z",
      "version": "2.4.22071601",
      "notes": [
        "[NEW] In-meeting Chat (Bullet Chatting) - You are now able to send message in meeting and it will be displayed like bullet chatting on meeting screen. It allows user to set quick message as well.",
        "[IMPROVED] Markdown Format - Added more supported format for bot messages.",
        "[IMPROVED] Chat Folder v2 - Added recommended folder, eg. @me, Unread, etc for better chat organization.",
        "[IMPROVED] Leader’s Name Card Lookup - Click the Leader’s name on the person’s name card to view their leader’s name card.",
        "[NEW] Message Draft - Adding Draft label for message that is not sent for the chat, ease the user to find out where they left off."
      ]
    },
    {
      "pub_date": "2022-07-09T12:00:00Z",
      "version": "2.4.22070903",
      "notes": [
        "[NEW] Meeting feedback feature after you end group call.",
        "[NEW] Block specific bot to stop receiving private message from the bot.",
        "[NEW] Mark a chat as read or unread.",
        "[NEW] double click unread message count jump between unread chats.",
        "[IMPROVED] Improve meeting experience - Noise calcellation/ Display meeting window by default when you click Wea icon.",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-06-30T12:00:00Z",
      "version": "2.4.22063005",
      "notes": [
        "[NEW] Added Mute feature for private chat and group, unread message count UI will be controlled by mute option instead of notification setting.",
        "[NEW] Added multiple List feature for department bot.",
        "[NEW] Added new option for theme setting which allow app theme following system setting.",
        "[IMPROVED] Mac screen stay awake during meeting.",
        "[FIXED] Bug fixes (Rectified the message order/ Read message synchronisation between Mac and iOS)"
      ]
    },
    {
      "pub_date": "2022-06-18T12:00:00Z",
      "version": "2.3.22061803",
      "notes": [
        "[NEW] Launch of Wea Workspace, with the first mini program - Password Check",
        "[IMPROVED] Add more emoji reaction",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-06-11T01:27:23Z",
      "version": "2.3.22061104",
      "notes": [
        "[NEW] New Logo & Name Card",
        "[IMPROVED] Quick off Group Notification",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-05-29T01:27:23Z",
      "version": "2.3.22052804",
      "notes": [
        "[NEW] Emoji Reaction - Long waited feature, you may now adding emoji reaction to the messages.",
        "[NEW] Department Bot - Not just a department bot, you can blast the announcement to your own department or to a specific group of people outside your department (Application required in order to use the bot). ",
        "[NEW] Multi-SSO - Wea support multiple SSO account login now.",
        "[IMPROVED] Double click the widget to restore meeting window",
        "[IMPROVED] Optimised message preview in chat list - to display the last message sender",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-05-14T01:27:23Z",
      "version": "2.3.22051405",
      "notes": [
        "[IMPROVED] Whole new experience for meeting bar",
        "[NEW] Add-on group setting for only moderator able to add member",
        "[IMPROVED] Improve quick group experience",
        "[New] Tool tips",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-05-02T01:27:23Z",
      "version": "2.3.22050203",
      "notes": [
        "[New] Chat folder to group the chat for ease of access",
        "[NEW] Quick group",
        "[IMPROVED] Improve performance for smoother transition between chats",
        "[IMPROVED] Translation text expand to 4k",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-04-24T01:27:23Z",
      "version": "2.3.22042400",
      "notes": [
        "[IMPROVED] Meeting improvement, support to join meeting via link, able to switch between build in mic and speaker",
        "[IMPROVED] Support simple click to open an attachment",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-04-20T01:27:23Z",
      "version": "2.3.22042005",
      "notes": [
        "[New] Search chat history and members in groups",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-04-15T01:27:23Z",
      "version": "2.3.22041501",
      "notes": [
        "[New] Upload group profile photo",
        "[New] Photo carousel preview available now, supporting zoom in and out",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-04-07T01:27:23Z",
      "version": "2.2.22040703",
      "notes": [
        "[New] Pin message available now, new joiner able to view the pinned messages",
        "[IMPROVED] Increase group members limitation from 200 to 2000",
        "[IMPROVED] Named poll that allow everyone in the group to see who voted for what after self voting up now, while anonymous poll still available.",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-03-19T01:27:23Z",
      "version": "2.2.22031903",
      "notes": [
        "[New] 🎉Topic for cross space Bot.",
        "[IMPROVED] Messages load faster",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-03-10T12:00:00Z",
      "version": "2.2.22031002",
      "notes": [
        "[New] Group creator able to manage group moderators, transfer ownership",
        "[IMPROVED] Bulk import new members for existing group",
        "[Fixed] Some bugs fixed"
      ]
    },
    {
      "pub_date": "2022-03-06T01:27:23Z",
      "version": "2.2.22030601",
      "notes": [
        "[New] Poll feature, able to create a quick survey and get answers fast",
        "[IMPROVED] Improve UX of the chat window",
        "[New] Join group via shared url by group members",
        "[IMPROVED] Improve audio and video performance in conference call",
        "[IMPROVED] Translated message able to by copied",
        "[FIXED] Bug fixes"
      ]
    },
    {
      "pub_date": "2022-02-17T11:27:23Z",
      "version": "2.2.22021703",
      "notes": [
        "[New] Simple and secure high quality video calls",
        "[Fixed] Fix the mute status sometimes showing wrong in group meeting",
        "[IMPROVED] Improve creating new group via CSV file with case insensitive",
        "[IMPROVED] Implement noise reduction mode to reduce most of the stationary background noise",
        "[IMPROVED] Enable multiple select/ unselect with holding on Shift key"
      ]
    },
    {
      "pub_date": "2022-02-06T10:27:23Z",
      "version": "2.2.22020602",
      "notes": [
        "[IMPROVED] Improved and Interactive @ feature",
        "[IMPROVED] Muted/Unmuted status display in voice conference",
        "[IMPROVED] Multi-message selection by hitting shift + click on the message timing",
        "[New] Newly added shortcut on copying image in the message",
        "[New] Allows bulk import members by email address via CSV when creating a new group",
        "[IMPROVED] Translation - when the original text is similar to the translated text, the original text will be retained"
      ]
    },
    {
      "pub_date": "2022-01-27T12:00:00Z",
      "version": "2.2.22012704",
      "notes": [
        "[New] Simple(Lightweight) task assignment feature",
        "[New] Whole window Translation function for private chat and group chat",
        "[New] Single message allow to be translated even whole window translation off"
      ]
    },
    {
      "pub_date": "2022-01-10T12:00:00Z",
      "version": "2.2.22011001",
      "notes": [
        "[New] Recall message",
        "[New] Encrypted voice calling (Temporary unavailable due to server-side control)",
        "[New] Automatically archive expired inactive sessions",
        "[Fixed] Fix not responding while tapping on address book",
        "[IMPROVED] Multiple images sending will be split into one image per message and followed by the text message after the last image."
      ]
    }
  ]
}
